# InvKN Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..InvKN Property
SymbolTypeId Class See Also
---
Symbol 1/kN, indicating unit Inverse kilonewtons.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId InvKN { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvKN As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InvKN {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace